# list არის ცვლადი სადაც შეგიძლია ბევრი რამე მოათავსო
# index არის დანომრვა
# slicing არის ამოჭრა ის გეხმერება რასაც ამოჭრი მარტო ეგ გამოიტანოს მაგ:
#          0         1       2      3            4
fruits = ["ვაშლი", "ბანანი","ატამი", "ნესვი", "საზამთრო"]
print(fruits[1:4])
#                                          greet = მისალმება
# def ის გვერდით რასაც დავწერთ მაგალითად greet და ფრჩხილებს თუ მივეწურთ ის შექმნის ფუნქციას მაგრამ ორი წერტილი უნდა დაუწერო ფრჩხილების მერე რომ ინდენტაცია შეიქმნას და დაბლა რასაც დავწერთ პრინტ-ში ან რამე სხვას როცა დაწერ greet() გამოიტანს შენ რაც დაწერე ფუნქციის ქვემოთ მაგ:
def gret():
    print("hello i am superman")
gret()

def greet():
    print("Hello user")
greet()