#for ეუბნება პითონს რომ უნდა შევქმნად for loop 
#for და in-ის შუაში ვწერთ საიტერაციო ცვლადს ის ყოველ იტერაციაზე იცვლის მნიშვნელობას
#in ის საშუალებით ჩვენ შეგვიძლია პროგრამას ვუთხრათ სად უნდა ეძებოს საიტერაცია ცვლადისთვის თვის მნიშვნელობა
#range არის ფუნქცია რომლის საშუალებით ვქმნით ციფრების მიმდევრობას range(10) შექმნის 0 1 2 3 4 5 6 7 8 9
#: ანიშნებს პითონს რომ for loop ის წერა დამთავრდა და ინდენტაცია რომელ ხაზზეც იქნება დაცული იქნება for loop ში მოთავსდება, ამ შემთხვევაში გამეორდება 10-ჯერ
#print("i") ტერმინალში გამოიტანს i რაც ინახება იქამდე სანამ for loop ი იმუშავებს
#for loop თითო იტერაციაზე i შენახული მნიშვნელობა იცვლება
