#  upper ყველა ასოს ადიდებს lower ყველა ასოს აპატარავებს capitalize პირველ ასოს ადიდებს და დანარჩენს აპატარავებს find პოულობს ასოებს ან რიცხვებს 
# len() ითვლის რამდენი ინდექსია ლისტში  append() ლისტში სულ ბოლოს ამატებს ინდექს insert() ლისტში ამატებს ინდექს შენ სადაც გინდა pop() ლისტიდან ამოაგდებს ინდექს
movies = ["home alone", "stranger things"]
print(len(movies))
print(movies.append("titanic"))
print(movies.pop(2))
print(movies.insert(0 , "titanic"))
# split ფუნქცია ცვლადში ყველა სიტყვას გადააქცევს ლისტად
# სტრინგი არის სიმბოლოების მიმდევრობა და უცვლადი ტიპია.
# ლისტი არის ელემენტების კოლექცია და ცვლადი ტიპია
