# > -მეტობა  < -ნაკლებობა == -ტოლია != -არ უდრის >= -მეტია ან ტოლია  <= -ნაკლები ან ტოლია 
# თუ 1 მაგალითი სწორია და მეორე არა არის და and-ის მაგალითია გამოიტანს არასწორს თუ ორივე სწორია გამოიტანს სწორს and-ის მაგალითში
#or-ის მაგალითში გამოიტანს ტყუილს თუ ორივე არასწორია. გამოიტანს or-ის მაგალითში სწორს თუ ერთი მაგალითია სწორი ან ორივეalgorithm - ალგორითმი არის ნაბიჯ-ნაბიჯ მოცემული ინსტრუქცია
#algorithm - ალგორითმი არის ნაბიჯ-ნაბიჯ მოცემული ინსტრუქცია
#pseudocode - ფსევდო კოდს არ არის პროგრამირების ენა უბრალოდ მიახლოებულია, ის გვეხმარება წამოვადგინიოთ ალგორითმი
#flowchart - გვეხმარება რომ ვიზუალურად წარმოვიდგინოთ ალგორითმები
#sequencing - თანმიმდევრობა
#iteration - გამეორება


