#print-ს გამოაქვს ტერმინალში
#ცვლადი ქმნის რაღაცას რაც პიტონი დაიმახსოვრებს მაგაითად name = "goa" და მაგის მერე თუ დაპრინტავ name-ს ტერმინალში გამოიტანს goa-ს
#სნეიკ კეისი არის _ მითი შეგვიძლია დავწეროთ გრძელი სიტყვა მაგალითად i_love_pancakes. თუ დაწერ i love pancakes-ესე ერორს გამოიტანს
#კომენტარით შეგვიძლია დავწეროთ რამ რასაც ვისუალ სტუდიო კოდი ვერ წაიკითხავს კომენტარით შეგვიზლია მივუწეროთ რას ვაკეთებს მაგალითად 
#ვქმნით ცვლადს
#item = "phone"
goa_is_best = "true"
goa_teaches = "true"
goa_makes_us_learn_proggraming = "true"
#დებაგინგი არის კოდის გატესტვა და აქვს 3 ეტაპი.
#integer-ი არის მთელი რიცხვი მაგალითად 8. string-ი არის ნებისმიერი სიტყვა ფრჩხილებში და ბრჭყალებში. float-ი არის რიცხვი რომელიც არ არის მთელი მაგალითად 9.5
name = 8
goa = "best"
worst_number = 6.7
